#
# РАЗДЕЛ ИМПОРТА МОДУЛЕЙ
#
#
#РАЗДЕЛ СОЗДАННЫХ ФУНКЦИЙ
#
def genVis():
    HANGMAN_PICT = ['''
    +---+
        |
        |
        |
       ===''','''
    +---+
    0   |
        |
        |
       ===''','''
    +---+
    0   |
    |   |
        |
       ===''','''
    +---+
    0   |
   /|   |
        |
       ===''','''
    +---+
    0   |
   /|\  |
        |
       ===''','''
    +---+
    0   |
   /|\  |
        |
       ===''','''
    +---+
    0    |
   /|\   |
   /     |
       ===''','''
    +---+
    0    |
   /|\   |
   / \   |
       ===''']
    return HANGMAN_PICT

def genSlov():
    wors = ['аноконда акула белка быки гусь галка жаба журавль зебра змея индейка ирбис кабан кенгуру лама леопард мышь мартышка нанду насорог олень орел павлин панда ревун рысь сайгак скат тигр тюлень уж улитка филин хомяк цапля червяк щука ястеб ящерица'.split()]
    return wors
#
# ОСНОВНОЕ ТЕЛО ПРОГРАММЫ 
#